In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')
titanic.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [4]:
#소문자 변형
titanic['Name'].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [5]:
#대문자 변형
titanic['Name'].str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

# Split

In [6]:
titanic['Name Splited'] = titanic['Name'].str.split(',')
titanic.head(2)

   PassengerId  ...                                       Name Splited
0            1  ...                         [Braund,  Mr. Owen Harris]
1            2  ...  [Cumings,  Mrs. John Bradley (Florence Briggs ...

[2 rows x 13 columns]

In [7]:
titanic['Surname'] = titanic['Name Splited'].str.get(0)
titanic.head(2)

   PassengerId  ...  Surname
0            1  ...   Braund
1            2  ...  Cumings

[2 rows x 14 columns]

In [8]:
#위의 두 과정을 한줄로
titanic['Name'].str.split(',').str.get(0)

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

# Contains

In [10]:
titanic[titanic['Name'].str.contains("Countess")]

     PassengerId  ...  Surname
759          760  ...   Rothes

[1 rows x 14 columns]

# Len: 문자열 길이

In [13]:
titanic['Name Length'] = titanic['Name'].str.len()

In [15]:
titanic[titanic['Name Length'] == titanic['Name Length'].max()]

     PassengerId  Survived  ...  Name Lenght Name Length
307          308         1  ...           82          82

[1 rows x 16 columns]

In [19]:
titanic.loc[titanic['Name Length'].idxmax(),:]

PassengerId                                                   308
Survived                                                        1
Pclass                                                          1
Name            Penasco y Castellana, Mrs. Victor de Satode (M...
Sex                                                        female
Age                                                            17
SibSp                                                           1
Parch                                                           0
Ticket                                                   PC 17758
Fare                                                        108.9
Cabin                                                         C65
Embarked                                                        C
Name Splited    [Penasco y Castellana,  Mrs. Victor de Satode ...
Surname                                      Penasco y Castellana
Name Lenght                                                    82
Name Length                                                    82
Name: 307, dtype: object

In [20]:
#이름만 출력
titanic.loc[titanic['Name Length'].idxmax(),'Name']

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

# Replace

In [21]:
titanic['Sex short'] = titanic['Sex'].replace({'male':'M','female':'F'})

In [22]:
titanic

     PassengerId  Survived  Pclass  ... Name Lenght Name Length  Sex short
0              1         0       3  ...          23          23          M
1              2         1       1  ...          51          51          F
2              3         1       3  ...          22          22          F
3              4         1       1  ...          44          44          F
4              5         0       3  ...          24          24          M
..           ...       ...     ...  ...         ...         ...        ...
886          887         0       2  ...          21          21          M
887          888         1       1  ...          28          28          F
888          889         0       3  ...          40          40          F
889          890         1       1  ...          21          21          M
890          891         0       3  ...          19          19          M

[891 rows x 17 columns]